app/Controllers/LoginController.php

SELECT *
FROM `usuarios`
WHERE `email` = 'kevingarcia@gmail.com'
OR `usuario` = 'kevingarcia@gmail.com'
 LIMIT 1
---
    public function auth() {
        $session = session();
        $model = new Usuarios_model();

        // Obtiene el email o usuario y la contraseña desde el formulario
        $login = $this->request->getVar('email'); // puede ser email o usuario
        $password = $this->request->getVar('pass');

        // Busca en la base de datos el usuario por email o usuario
        $data = $model->where('email', $login)
                        ->orWhere('usuario', $login)
                        ->first();