app/Controllers/Pages.php

    public function productos()
    {
        $productoModel = new Productos_Model();
        $categorias = new Categorias_Model();
        $data['producto'] = $productoModel
                                ->select('productos.*, categorias.descripcion as categoria')
                                ->join('categorias', 'productos.categoria_id = categorias.id_categoria')
                                ->orderBy('id_producto', 'DESC')
                                ->findAll();

        $data['categorias'] = $categorias->select('descripcion')->distinct()->findAll();
---
SELECT `productos`.*, `categorias`.`descripcion` as `categoria`
FROM `productos`
JOIN `categorias` ON `productos`.`categoria_id` = `categorias`.`id_categoria`
ORDER BY `id_producto` DESC
SELECT DISTINCT `descripcion`
FROM `categorias`