app/Controllers/ProductoController.php

    public function index() {
        $perfil = session()->get('perfil_id');

        if ($perfil != 1) {
            return redirect()->to('/login');
        }

        $productoModel = new Productos_model();

        $vista = $this->request->getVar('vista') ?? 'NO'; // 'NO' para activos, 'SI' para eliminados

        $data['productos'] = $productoModel->where('eliminado', $vista)->findAll(); //funcion en el modelo
---
SELECT *
FROM `productos`
WHERE `eliminado` = 'NO'