app/Controllers/VentasController.php

    public function estadisticas() {
        $perfil = session()->get('perfil_id');
        if ($perfil != 1) return redirect()->to('/login');

        $ventasModel = new VentasCabecera_model();

        // Obtener conteo por estado
        $data['stats'] = [
            'PENDIENTE'  => $ventasModel->where('estado', 'PENDIENTE')->countAllResults(),
            'EN_PROCESO' => $ventasModel->where('estado', 'EN_PROCESO')->countAllResults(),
            'TERMINADO'  => $ventasModel->where('estado', 'TERMINADO')->countAllResults(),
            'ENTREGADO'  => $ventasModel->where('estado', 'ENTREGADO')->countAllResults(),
        ];

        // Consultas activas
        $consultasModel = new \App\Models\Consultas_model();
        $data['total_consultas'] = $consultasModel->where('activo', 'SI')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `consultas`
WHERE `activo` = 'SI'