app/Models/Usuarios_model.php

    public function getUsuariosAll() {
        return $this->select('usuarios.*, perfiles.descripcion as perfil')
                    ->join('perfiles', 'perfiles.id = usuarios.perfil_id')
                    ->findAll();
---
SELECT `usuarios`.*, `perfiles`.`descripcion` as `perfil`
FROM `usuarios`
JOIN `perfiles` ON `perfiles`.`id` = `usuarios`.`perfil_id`