app/Models/VentasCabecera_model.php

    public function getVentas($id = null, $id_usuario = null) {
        $db = \Config\Database::connect();
        $builder = $db->table('ventas_cabecera');
        $builder->select('*');

        $builder->join('usuarios', 'usuarios.id_usuario = ventas_cabecera.usuario_id');

        if ($id != null) {
            $builder->where('ventas_cabecera.id', $id);
        }

        if ($id_usuario != null) {
            $builder->where('ventas_cabecera.usuario_id', $id_usuario);
        }

        $query = $builder->get();
---
SELECT *
FROM `ventas_cabecera`
JOIN `usuarios` ON `usuarios`.`id_usuario` = `ventas_cabecera`.`usuario_id`
WHERE `ventas_cabecera`.`usuario_id` = '6'